DROP TABLE IF EXISTS our_product_parts;
CREATE TABLE our_product_parts (

	id serial NOT NULL UNIQUE PRIMARY KEY,
	number varchar(50) NOT NULL UNIQUE,
	name varchar(50) NOT NULL,
	status varchar(50) NOT NULL,
	version varchar(50) NOT NULL,
	update varchar(50) NOT NULL

);


-- Заполнение таблицы our_product_parts
INSERT INTO our_product_parts (

	number,
	name,
	status,
	version,
	update

)

-- Занесение данных в таблицу
VALUES

	('BPG000-00001', 'Корпус', 'NOTE', 'BPG18-20', '14.10.2020'),
	('BPG000-00002', 'Золотник', 'NOTE', 'BPG9-17', '23.02.2017'),
	('BPG000-00003', 'Корпус клапана', 'NOTE', 'BPG8-16', '21.11.2016'),
	('BPG000-00004', 'Клапан', 'NOTE', 'BPG8-16', '21.11.2016'),
	('BPG000-00005', 'Пружина', 'NOTE', 'BPG8-16', '21.11.2016'),
	('BPG000-00006', 'Заглушка', 'NOTE', 'BPG8-16', '21.11.2016'),
	('BPG000-00007', 'Винт', 'NOTE', 'BPG8-16', '21.11.2016'),
	('BPG000-00008', 'Штуцер', 'NOTE', 'BPG8-16', '21.11.2016'),
	('BPG000-00009', 'Направляющая', 'NOTE', 'BPG9-17', '23.02.2017'),
	('BPG000-00010ГЧ', 'Табличка', 'NOTE', 'BPG8-16', '21.11.2016'),
	
	('EHR70-00002', 'Золотник подъема', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00003', 'Золотник перепуска', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00004', 'Пробка', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00005', 'Пружина', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00008', 'Гайка контровочная', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00009', 'Винт регулировочный', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00010', 'Пробка', 'NOTE', 'EHR16-19', '14.08.2019'),
	('EHR70-00011', 'Тарелка', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00012', 'Пружина', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00013', 'Пружина', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00014', 'Пружина', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00015', 'Седло клапана', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00016', 'Направляющая', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00017', 'Шайба', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00018', 'Кольцо', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00019', 'Кольцо уплотнительное', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00020', 'Шайба упорная', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00023', 'Корпус', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00024', 'Заглушка', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-00031ГЧ', 'Табличка ', 'NOTE', 'EHR15-19', '10.04.2019'),
	
	('EHR70-10001', 'Корпус ', 'NOTE', 'EHR16-19', '10.07.2019'),
	('EHR70-10002', 'Клапан ', 'NOTE', 'EHR16-19', '10.07.2019'),
	('EHR70-10003', 'Золотник ', 'NOTE', 'EHR16-19', '10.07.2019'),
	('EHR70-10004', 'Тарелка ', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-10005', 'Проставка ', 'NOTE', 'EHR15-19', '10.04.2019'),
	('EHR70-10006', 'Опора ', 'NOTE', 'EHR15-19', '10.04.2019');
	
	